export const TopicGroups: { [index: string]: any } = {
  สินค้าเวชภัณฑ์: ['เจลแอลกอฮอล์', 'หน้ากากอนามัย'],
  ระบบบริการสุขภาพ: [
    'ค่ารักษา',
    'บริจาค',
    'บุคลากร',
    'ประกัน',
    'โรงพยาบาล',
    'ขาดแคลน',
  ],
};

export const KeywordGroups: { [index: string]: any } = {
  โควิด: {
    required: [
      'ไวรัส',
      'อู่ฮั่น',
      'โคโรน่า',
      'โคโรนา',
      'โรคระบาด',
      'โควิด',
      'covid',
      'corona',
    ],
    others: [],
  },
  เจลแอลกอฮอล์: {
    required: ['เจล', 'แอลกอฮอล์'],
    others: ['เจลแอลกอฮอล์'],
  },
  หน้ากากอนามัย: {
    required: ['แมส', 'หน้ากาก'],
    others: ['หน้ากากอนามัย'],
  },
  ค่ารักษา: {
    required: ['ค่ารักษา', 'บัตรทอง'],
    others: ['รพ', 'ฟรี', 'แพง'],
  },
  บริจาค: {
    required: ['บริจาค'],
    others: ['ขาดแคลน', 'หน้ากาก', 'โรงพยาบาล'],
  },
  บุคลากร: {
    required: ['บุคลากร', 'หมอ'],
    others: ['โรงพยาบาล', 'รw', 'กลัว', 'กักตัว', 'อาหาร', 'ผีน้อย'],
  },
  ประกัน: {
    required: ['ประกัน'],
    others: [],
  },
  โรงพยาบาล: {
    required: ['โรงพยาบาล', 'รพ'],
    others: [],
  },
  ขาดแคลน: {
    required: ['ขาดแคลน'],
    others: ['หน้ากาก', 'แมส', 'บริจาค'],
  },
};

export default { TopicGroups, KeywordGroups };
